<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" dir="ltr" lang="de" xml:lang="de">
<head>
	<title>Tritanium Bulletin Board 2 Dokumentation</title>
	<style type="text/css">
		a:link {
			color:blue;
			text-decoration:none;
		}
		a:visited {
			color:blue;
			text-decoration:none;
		}
		a:hover {
			color:red;
			text-decoration:underline;
		}

		h1 {
			text-align:center;
			font-family:verdana,arial;
			font-size:30px;
			font-weight:normal;
			margin-bottom:60px;
		}

		h2 {
			font-family:verdana,arial;
			font-size:20px;
			font-weight:normal;
			margin-top:50px;
		}

		.fontnorm {
			font-family:verdana,arial;
			font-size:13px;
		}

		.fontcopyright {
			font-family:verdana,arial;
			font-size:10px;
			margin-top:50px;
		}

		p {
			text-align:justify;
		}
	</style>
</head>
<body>
<h1>Tritanium Bulletin Board 2 - Beta 2 (0.2.3)</h1>

<h2>Inhaltsverzeichnis</h2>
<ul class="fontnorm">
	<li><a href="#importantnotice">Allgemeine Hinweise</a></li>
	<li><a href="#installation">Installation</a></li>
	<li><a href="#updatetbb2">Update von einer &auml;lteren Version des Tritanium Bulletin Board 2</a></li>
	<li><a href="#updatetbb1">Update vom Tritanium Bulletin Board 1</a></li>
</ul>

<h2 id="importantnotice">Allgemeine Hinweise</h2>
<p class="fontnorm">Bei dieser Version handelt es sich um eine <b>Betaversion</b>! Dies bedeutet, dass der Gro&szlig;teil der Funktionalit&auml;t weitgehend fehlerfrei zur Verf&uuml;gung steht, die Software aber weder auf Sicherheit noch auf Geschwindigkeit &uuml;berpr&uuml;ft und/oder optimiert wurde. <b>Von einem Einsatz in einem produktiven Umfeld wird dringend abgeraten!</b></p>

<h2 id="installation">Installation</h2>
<ul class="fontnorm">
	<li>Das komplette Archiv (z.B. per FTP) auf den Webserver hochladen, die Ordnerstruktur &uuml;bernehmen (der Ordner &quot;docs&quot; sollte aber weggelassen werden).</li>
	<li>Grunds&auml;tzlich sollten alle Ordner die Rechte 0700 und alle Dateien die Rechte 0600 besitzen. Ist der Webserver schlecht konfiguriert, kann es helfen die Rechte auf 0755 f&uuml;r Ordner und auf 0644 f&uuml;r Dateien zu setzen. Sollten damit immernoch Probleme bestehen, k&ouml;nnen noch folgende einzelne Spezialrechte gesetzt werden. Allerdings ist dies sehr sicherheitskritisch und sollte wenn m&ouml;glich vermieden werden!
		<ul>
			<li>./cache 777</li>
			<li>./config/DB.config.class.php 777</li>
			<li>./uploads/avatars 777</li>
			<li>./uploads/files 777</li>
		</ul>
	</li>
	<li>Die Installation per install.php aufrufen und den Anweisungen folgen</li>
	<li>Nach der Installation &quot;install.php&quot; l&ouml;schen</li>
	<li>Das Forum per index.php aufrufen</li>
	<li>Fehler, Verbesserungsvorschl&auml;ge, Anregungen usw. bitte per Mail an <a href="mailto:julian@tritanium-scripts.com">julian@tritanium-scripts.com</a> oder ins Forum unter <a target="_blank" href="http://www.tritanium-scripts.com">http://www.tritanium-scripts.com</a></li>
</ul>

<h2 id="updatetbb2">Update von einer &auml;lteren Version des Tritanium Bulletin Board 2</h2>
<p class="fontnorm">
	Erstellen Sie am besten einen neuen Ordner f&uuml;r die neue Forenversion und folgenden Sie der Installation wie oben beschrieben. Bei der Suche nach einer vorhandenen Installation sollte die &auml;ltere Version automatisch gefunden und geupdatet werden. Daraufhin fahren Sie mit dem Installationsvorgang normal fort. Anschlie&szlig;end k&ouml;nnen Sie den Ordner der alten Version l&ouml;schen und den neuen gegebenenfalls umbenennen.
	<br/>Anmerkungen zu verschiedenen Versionen ein Update betreffend:
</p>
<ul class="fontnorm">
	<li>Version 0.2.1 (Alpha 10):<br/>Alle Dateien mit der Endung &quot;.language&quot; im Ordner &quot;languages/de&quot; sollten gel&ouml;scht werden. Sie wurden durch entsprechende Dateien mit der Endung &quot;.ini&quot; ersetzt.</li>
	<li>Version 0.2.0.8.20050121 (Alpha 8) oder &auml;lter:<br/>Der Ordner &quot;language&quot; sollte gel&ouml;scht werden, da er nicht mehr ben&ouml;tigt wird. Er wurde durch den Ordner &quot;languages&quot; ersetzt, der auch einen anderen Ordner beinhaltet.</li>
</ul>

<h2 id="updatetbb1">Update vom Tritanium Bulletin Board 1</h2>
<p class="fontnorm">Seit dem Tritanium Bulletin Board 2 Version Alpha 10 ist ein Konvertierungsscript im Installationsscript integriert. Folgenden Sie einfach den normalen Installationsschritten, bis Sie gefragt werden, ob Sie Daten einer alten &quot;Tritanium Bulletin Board 1&quot;-Installation &uuml;bernehmen wollen und w&auml;hlen Sie an dieser Stelle &quot;Ja&quot;.</p>

<div class="fontcopyright">&copy; 2003-2009 <a target="_blank" href="http://www.tritanium-scripts.com">Tritanium Scripts</a></div>
</body>
</html>